{
  "user": [
    {
      "name": "Phan Tuan Tu",
      "mobNumber": "0392238575",
      "age": 27,
      "dob": "02/04/1997",
      "email": "phantuantu@secure.janeto.com",
      "password": "123456",
      "address": {
        "addLine1": "Morning",
        "addLine2": "Star Building",
        "city": "HCM",
        "state": "GV",
        "zipCode": "70000"
      },
      "language": ["English", "Vietnamese"],
      "gender": "Male",
      "abouYou": "I'm bad boy, but not a bad choice",
      "uploadPhoto": "",
      "agreetc": true,
      "role": "admin",
      "id": 1
    }
  ],
  "products": [
    {
      "id": 1,
      "name": "Xiaomi Redmi Note 11",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/245261/Xiaomi-redmi-note-11-blue-600x600.jpg",
      "productDesc": "Xiaomi Redmi Note 11 is considered an impressive mid-range smartphone, with a strong configuration, excellent camera cluster, strong battery, fast charging and a very affordable price.",
      "mrp": "1000",
      "dp": "499",
      "status": "publish"
    },
    {
      "id": 2,
      "name": "Phone 13 Pro Max 128GB",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/230529/iphone-13-pro-max-xanh-la-thumb-600x600.jpg",
      "productDesc": "The device's design is not very groundbreaking compared to its predecessor, the screen is super beautiful, the scanning frequency is upgraded to a smooth 120 Hz, the camera sensor is larger in size.",
      "mrp": "540",
      "dp": "299",
      "status": "draft"
    },
    {
      "id": 3,
      "name": "Vivo Y33s",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/249102/Vivo-y33s-yellow-thumb-600x600.jpg",
      "productDesc": "Vivo Y33s has a youthful design with mirror black and dreamy blue. The black version is covered with a shiny mirror coating, which can become a convenient mirror.",
      "mrp": "320",
      "dp": "199",
      "status": "inactive"
    },
    {
      "id": 4,
      "name": "OPPO Reno7 Z 5G",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/271717/oppo-reno7-z-5g-thumb-1-1-600x600.jpg",
      "productDesc": "The product has an exclusive OPPO Glow design, a camera with effects like a professional DSLR with dual light borders, a powerful configuration and an A-rated certification for smoothness.",
      "mrp": "420",
      "dp": "399",
      "status": "draft"
    },
    {
      "id": 5,
      "name": "Samsung Galaxy A03 3GB",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/251856/samsung-galaxy-a03-xanh-thumb-600x600.jpg",
      "productDesc": "This is the first Galaxy A phone from Samsung in 2022 in Vietnam. The product has an accessible price, main camera up to 48 MP, 5000 mAh battery for comfortable use all day.",
      "mrp": "299",
      "dp": "199",
      "status": "publish"
    },
    {
      "id": 6,
      "name": "Samsung Galaxy A52s 5G",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/247507/samsung-galaxy-a52s-5g-mint-600x600.jpg",
      "productDesc": "The Galaxy A52s 5G phone is an upgraded version of the Galaxy A52 5G, with unchanged appearance but significantly upgraded internal configuration parameters.",
      "mrp": "1099",
      "dp": "899",
      "status": "publish"
    },
    {
      "id": 7,
      "name": "Laptop Acer TravelMate",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/265015/Slider/vi-vn-acer-travelmate-b3-tmb311-31-c2hb-nxvnfsv006-thumbvideo.jpg",
      "productDesc": "Acer TravelMate B3 TMB311 31 C2HB laptop (NX.VNFSV.006) targets the study-office laptop segment, serving basic needs on laptops, with compact size and sufficient performance, making it the choice Good choice for pupils and students. Compact design, high portability. Acer TravelMate B3 has a weight of only 1.4 kg, a thickness of 20.99 mm, an elegant and beautiful design with a simple black plastic shell and a delicate company logo in the left corner of the back, easily appearing with you anywhere. everywhere.",
      "mrp": "599",
      "dp": "299",
      "status": "draft"
    },
    {
      "id": 8,
      "name": "MacBook Pro 14 M1 Pro",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/253581/Slider/vi-vn-macbook-pro-14-m1-pro-2021-8-core-cpu-thumbvideo.jpg",
      "productDesc": "Apple introduced the 14-inch MacBook Pro in October 2023, with a new look and self-developed processor, which not only provides outstanding performance but also has a screen with real visibility. Impressive, makes me fascinated when I hold it in my hand and experience it. Peak performance power like never before. The 14-inch MacBook Pro has an M1 Pro processor manufactured using a modern 5 nm process, integrating 8 CPU cores with 6 high-performance cores and 2 energy-saving cores, promising fast processing capabilities. up to 70% more than M1's CPU, while significantly reducing power consumption to extend battery life.",
      "mrp": "4999",
      "dp": "3990",
      "status": "draft"
    },
    {
      "id": 9,
      "name": "Laptop HP 15s i3",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/284190/Slider/vi-vn-hp-15s-fq2662tu-i3-6k795pa-1.jpg",
      "productDesc": "HP 15s fq2662TU i3 (6K795PA) laptop will be a suitable choice for students who want to find a study - office laptop with stable configuration, meeting all basic needs at the same level. Ideal price, easy access. The basic HP laptop is covered by a silver plastic shell, providing a minimalist yet elegant beauty. The weight of 1.7 kg helps you easily put it in your backpack and bring it everywhere to study and work. Connection ports such as USB Type-C, USB A, HDMI, SD memory card reader and 3.5 mm headphone jack are equipped around the laptop allowing you to connect to other peripheral devices such as speakers, mice, computers. projection,... more quickly without the need for cumbersome cables.",
      "mrp": "999",
      "dp": "599",
      "status": "publish"
    },
    {
      "id": 10,
      "name": "Lenovo Ideapad 15IAU7",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/287769/Slider/vi-vn-lenovo-ideapad-3-15iau7-i3-82rk005lvn-thumbvideo.jpg",
      "productDesc": "Lenovo Ideapad 3 15IAU7 i3 laptop (82RK005LVN) will be an effective companion for students or office workers with its elegant, modern appearance and powerful performance from the Intel Gen 12 chip. modern. Lenovo Ideapad laptop solves all tasks of a study-office laptop from basic to advanced thanks to the combination of Intel Core i3 1215U processor and Intel UHD Graphics graphics card. Running heavy Excel files while watching multitasking entertainment movies is still very smooth thanks to 8 GB RAM. Spacious storage space thanks to a 256 GB SSD hard drive that can install another stick of up to 1 TB. The simple but equally modern and elegant gray color helps its owner stand out everywhere. Laptops have numeric keypads to make data entry easier.",
      "mrp": "1200",
      "dp": "899",
      "status": "publish"
    },
    {
      "id": 11,
      "name": "Asus Vivobook 14X i3",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/285770/Slider/vi-vn-asus-vivobook-14x-a1403za-i3-ly143w-1.jpg",
      "productDesc": "If you are a student or office worker, you should not ignore the Asus Vivobook 14X A1403ZA i3 (LY143W) laptop - a study-office laptop version of the Asus family that satisfies essential daily tasks well. thanks to its powerful Intel Gen 12 chip. The appearance of the Intel Core i3 1220P processor has helped the Asus laptop perfectly handle all daily learning and working tasks, accompanied by an Intel UHD Graphics card that satisfies the user's creative passion with Basic photo editing and design work. 8 GB RAM provides smooth multitasking capabilities in many different browser windows at the same time, while increasing read and write speeds significantly faster than the previous generation thanks to the 512 GB SSD hard drive.",
      "mrp": "1399",
      "dp": "1299",
      "status": "inactive"
    },
    {
      "id": 12,
      "name": "MSI Modern 14 i3",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/266898/Slider/vi-vn-msi-modern-14-b11mou-i3-1027vn-1.jpg",
      "productDesc": "MSI Modern 14 B11MOU i3 laptop (1027VN) is a popular laptop version launched by MSI with the mission of serving all basic daily essential tasks of users when possessing a stable configuration from the chip. Intel Gen 11 with elegant, trendy and highly portable appearance. Attract all eyes with its luxurious design. The durable metal shell with the main gray color exudes a luxurious and trendy look for the MSI Modern laptop, helping its owner stand out even more whether working in an office or crowded cafes. Flexibility is significantly improved when the machine has a weight of only 1.3 kg, allowing you to move it to any space you want without worrying about being bulky or heavy.",
      "mrp": "320",
      "dp": "199",
      "status": "publish"
    },
    {
      "id": 13,
      "name": "Acer Aspire 7 Game",
      "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/44/268775/Slider/vi-vn-acer-aspire-7-gaming-a715-42g-r4xx-r5-nhqaysv008-1.jpg",
      "productDesc": "Aspire 7 Gaming A715 42G R4XX R5 Laptop (NH.QAYSV.008) possesses strong performance and powerful design, making it an ideal companion on every journey. AMD Ryzen 5 5500U laptop with NVIDIA GeForce GTX 1650 4 GB discrete card, providing 2D design capabilities, short video rendering,... stable on Adobe software or entertainment with dramatic games on the market today now smoothly. The Acer Aspire laptop also has 8 GB RAM and 256 GB SSD to meet multitasking needs, helping you do things faster and more efficiently. This laptop version weighs 2.1 kg and is 22.9 mm thick, made from durable plastic, making it easy for you to carry everywhere.",
      "mrp": "1499",
      "dp": "999",
      "status": "draft"
    }
  ],
  "orders": [
    {
      "id": 1,
      "userId": 3,
      "sellerId": 2,
      "product": {
        "id": 1,
        "name": "Xiaomi Redmi Note 11",
        "uploadPhoto": "https://cdn.tgdd.vn/Products/Images/42/245261/Xiaomi-redmi-note-11-blue-600x600.jpg",
        "productDesc": "Xiaomi Redmi Note 11 is considered an impressive mid-range smartphone, with a strong configuration, excellent camera cluster, strong battery, fast charging and a very affordable price.",
        "mrp": "1000",
        "dp": "499",
        "status": "publish"
      },
      "deliveryAddress": {
        "id": 0,
        "addLine1": "ABC/52",
        "addLine2": "Asolinetic",
        "city": "Buladeish",
        "state": "Itsat",
        "zipCode": 156795
      },
      "contact": "0123456789",
      "dateTime": "18/07/2019"
    }
  ]
}
